cf_billing/InformationRegisters/бестНомерПломбПриборовУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестНомерПломбПриборовУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьНомерПломбы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОперацииСПломбой</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПломбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыПломб</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМестаУстановкиПломб</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПломбы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестНомерПломбПриборовУчетаНП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает номера пломб.
//
// Параметры:
//  Период			-	Дата.
//  мПриборыУчета	-	Массив из СправочникСсылка.энргПриборыУчетаАбонента.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ПолучитьНомераПломб(Период, мПриборыУчета) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестНомерПломбПриборовУчетаНПСрезПоследних.МестоУстановки КАК МестоУстановки,
		|	бестНомерПломбПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
		|	бестНомерПломбПриборовУчетаНПСрезПоследних.НомерПломбы КАК НомерПломбы,
		|	бестНомерПломбПриборовУчетаНПСрезПоследних.ВидПломбы КАК ВидПломбы
		|ИЗ
		|	РегистрСведений.бестНомерПломбПриборовУчетаНП.СрезПоследних(&Период, ПриборУчета В (&мПриборыУчета)) КАК бестНомерПломбПриборовУчетаНПСрезПоследних
		|ГДЕ
		|	бестНомерПломбПриборовУчетаНПСрезПоследних.Состояние
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриборУчета";
	
	Запрос.УстановитьПараметр("мПриборыУчета", мПриборыУчета);
	Запрос.УстановитьПараметр("Период", Период);
	
	Возврат Запрос.Выполнить();
	

КонецФункции

#КонецОбласти

#КонецЕсли
